tests/fixtures/artifact-replay/known-failure/case/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.05;
purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.002;

functions
{
    alphaWaterMinimum
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        regionType      all;
        fields          (alpha.water);
        operation       min;
        writeFields     false;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }

    alphaWaterMaximum
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        regionType      all;
        fields          (alpha.water);
        operation       max;
        writeFields     false;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }

    waterVolume
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        regionType      all;
        fields          (alpha.water);
        operation       volIntegrate;
        writeFields     false;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }
}
