tests/fixtures/artifact-replay/known-failure/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0          0          0)
    (0.292      0          0)
    (0.31599948 0          0)
    (0.584      0          0)
    (0          0.04799896 0)
    (0.292      0.04799896 0)
    (0.31599948 0.04799896 0)
    (0.584      0.04799896 0)
    (0          0.584      0)
    (0.292      0.584      0)
    (0.31599948 0.584      0)
    (0.584      0.584      0)

    (0          0          0.0146)
    (0.292      0          0.0146)
    (0.31599948 0          0.0146)
    (0.584      0          0.0146)
    (0          0.04799896 0.0146)
    (0.292      0.04799896 0.0146)
    (0.31599948 0.04799896 0.0146)
    (0.584      0.04799896 0.0146)
    (0          0.584      0.0146)
    (0.292      0.584      0.0146)
    (0.31599948 0.584      0.0146)
    (0.584      0.584      0.0146)
);

blocks
(
    hex (0 1 5 4 12 13 17 16)     (23 8 1)  simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18)     (19 8 1)  simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20)     (23 42 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21)    (4 42 1)  simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22)   (19 42 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }

    right
    {
        type wall;
        faces
        (
            (3 7 19 15)
            (7 11 23 19)
        );
    }

    lower
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }

    obstacle
    {
        type wall;
        faces
        (
            (1 5 17 13)
            (2 14 18 6)
            (5 6 18 17)
        );
    }

    empty
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (12 13 17 16)
            (14 15 19 18)
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
        );
    }
);

mergePatchPairs
(
);
