tests/fixtures/artifact-replay/known-failure/case/constant/phaseProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}

type            immiscibleIncompressibleTwoPhaseMixture;

phases
(
    water
    air
);

sigma           0.07;
