tests/fixtures/artifact-replay/known-failure/case/constant/physicalProperties.air
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties.air;
}

viscosityModel  constant;

rho             [1 -3 0 0 0 0 0] 1;
nu              [0 2 -1 0 0 0 0] 1.48e-5;
