tests/fixtures/artifact-replay/known-failure/case/constant/physicalProperties.water
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties.water;
}

viscosityModel  constant;

rho             [1 -3 0 0 0 0 0] 1000;
nu              [0 2 -1 0 0 0 0] 1e-6;
