tests/fixtures/artifact-replay/known-failure/case/0/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    right
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    lower
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    atmosphere
    {
        type            prghTotalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    obstacle
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    empty
    {
        type            empty;
    }
}
