tests/fixtures/artifact-replay/known-failure/case/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                                     none;
    div(rhoPhi,U)                               Gauss linearUpwind grad(U);
    div(phi,alpha)                              Gauss vanLeer;
    div(phirb,alpha)                            Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U)))))         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
