tests/fixtures/artifact-replay/known-failure/case/system/setFieldsDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 0.292 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
